
## :x: Apply Failed (terraform/settings)

[CI link](https://github.com/air-hand/dotfiles/actions/runs/8399461753)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.github_repository.current: Reading...
data.github_repository.current: Read complete after 1s [id=dotfiles]
github_branch_protection.main: Refreshing state... [id=BPR_kwDOI-MFls4CWO3H]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_variable.tf_cloud_workspace will be created
  + resource "github_actions_variable" "tf_cloud_workspace" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "air-hand/dotfiles"
      + updated_at    = (known after apply)
      + value         = "dotfiles"
      + variable_name = "TF_CLOUD_WORKSPACE"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
github_actions_variable.tf_cloud_workspace: Creating...
╷
│ Error: POST https://api.github.com/repos/air-hand/air-hand/dotfiles/actions/variables: 404 Not Found []
│ 
│   with github_actions_variable.tf_cloud_workspace,
│   on actions.tf line 1, in resource "github_actions_variable" "tf_cloud_workspace":
│    1: resource "github_actions_variable" "tf_cloud_workspace" {
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":74,"Program":"tfcmt","SHA1":"99da1cd83bbeb223131857232a154b012c18e7a0","Target":"terraform/settings","Vars":{},"WorkflowName":"Terraform plan and apply"} -->